Revit 2024 API
ViewScheduleExportOptions.HeadersFootersBlanks Property
 Whether to export group headers, footers, and blank lines. Default is true.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool HeadersFootersBlanks { get; set; }
Visual Basic
Public Property HeadersFootersBlanks As Boolean
	Get
	Set
Visual C++
public:
property bool HeadersFootersBlanks {
	bool get ();
	void set (bool value);
}
See Also
ViewScheduleExportOptions Class
Autodesk.Revit.DB Namespace